llm-d-kvcache-offload-eval/fio/kvcache-storage-pvc-direct-q256.txt
=== WRITE TEST ===
pvc-write: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=64
...
fio-3.41
Starting 4 processes
pvc-write: Laying out IO file (1 file / 3072MiB)
pvc-write: Laying out IO file (1 file / 3072MiB)
pvc-write: Laying out IO file (1 file / 3072MiB)
[...]

pvc-write: (groupid=0, jobs=4): err= 0: pid=5: Mon Apr 20 20:51:49 2026
  write: IOPS=101, BW=101MiB/s (106MB/s)(6221MiB/61353msec); 0 zone resets
    slat (usec): min=38, max=2565.7k, avg=4627.21, stdev=107616.11
    clat (msec): min=2, max=5171, avg=2519.94, stdev=1508.43
     lat (msec): min=5, max=5171, avg=2524.56, stdev=1504.75
    clat percentiles (msec):
     |  1.00th=[   34],  5.00th=[  171], 10.00th=[  422], 20.00th=[  953],
     | 30.00th=[ 1452], 40.00th=[ 1972], 50.00th=[ 2601], 60.00th=[ 3037],
     | 70.00th=[ 3574], 80.00th=[ 4077], 90.00th=[ 4597], 95.00th=[ 4866],
     | 99.00th=[ 5000], 99.50th=[ 5134], 99.90th=[ 5201], 99.95th=[ 5201],
     | 99.99th=[ 5201]
   bw (  KiB/s): min=22528, max=577536, per=100.00%, avg=179015.08, stdev=44054.04, samples=273
   iops        : min=   22, max=  564, avg=174.82, stdev=43.02, samples=273
  lat (msec)   : 4=0.03%, 10=0.16%, 20=0.26%, 50=0.79%, 100=2.48%
  lat (msec)   : 250=3.15%, 500=4.45%, 750=5.16%, 1000=4.65%, 2000=19.37%
  lat (msec)   : >=2000=59.51%
  cpu          : usr=0.20%, sys=0.06%, ctx=3035, majf=0, minf=39
  IO depths    : 1=0.1%, 2=0.1%, 4=0.3%, 8=0.5%, 16=1.0%, 32=2.1%, >=64=95.9%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=0,6221,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=101MiB/s (106MB/s), 101MiB/s-101MiB/s (106MB/s-106MB/s), io=6221MiB (6523MB), run=61353-61353msec

Disk stats (read/write):
  vdd: ios=120/6284, sectors=15168/12695824, merge=1776/259, ticks=8433/11827086, in_queue=11835520, util=99.86%
=== READ TEST ===
pvc-read: (g=0): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=64
...
fio-3.41
Starting 4 processes
pvc-read: Laying out IO file (1 file / 3072MiB)
pvc-read: Laying out IO file (1 file / 3072MiB)
pvc-read: Laying out IO file (1 file / 3072MiB)
[...]

pvc-read: (groupid=0, jobs=4): err= 0: pid=13: Mon Apr 20 20:54:57 2026
  read: IOPS=100, BW=101MiB/s (105MB/s)(6291MiB/62556msec)
    slat (usec): min=3, max=331, avg=17.96, stdev=33.75
    clat (msec): min=6, max=5045, avg=2542.56, stdev=463.36
     lat (msec): min=6, max=5045, avg=2542.57, stdev=463.34
    clat percentiles (msec):
     |  1.00th=[  209],  5.00th=[ 2567], 10.00th=[ 2567], 20.00th=[ 2567],
     | 30.00th=[ 2567], 40.00th=[ 2567], 50.00th=[ 2567], 60.00th=[ 2567],
     | 70.00th=[ 2567], 80.00th=[ 2567], 90.00th=[ 2567], 95.00th=[ 2567],
     | 99.00th=[ 4396], 99.50th=[ 4732], 99.90th=[ 4933], 99.95th=[ 5067],
     | 99.99th=[ 5067]
   bw (  KiB/s): min=30720, max=352256, per=100.00%, avg=104341.06, stdev=8721.42, samples=484
   iops        : min=   30, max=  344, avg=101.90, stdev= 8.52, samples=484
  lat (msec)   : 10=0.70%, 50=0.06%, 100=0.06%, 250=0.25%, 500=0.38%
  lat (msec)   : 750=0.41%, 1000=0.38%, 2000=1.59%, >=2000=96.15%
  cpu          : usr=0.01%, sys=0.05%, ctx=3272, majf=0, minf=168
  IO depths    : 1=0.1%, 2=0.1%, 4=0.3%, 8=0.5%, 16=1.0%, 32=2.0%, >=64=96.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=6291,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=101MiB/s (105MB/s), 101MiB/s-101MiB/s (105MB/s-105MB/s), io=6291MiB (6597MB), run=62556-62556msec

Disk stats (read/write):
  vdd: ios=6268/4, sectors=12836864/40, merge=0/1, ticks=15625681/91, in_queue=15625773, util=99.88%