llm-d-kvcache-offload-eval/fio/kvcache-storage-pvc-direct.txt
=== WRITE TEST ===
pvc-write: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=64
...
fio-3.41
Starting 64 processes
pvc-write: Laying out IO file (1 file / 3072MiB)
pvc-write: Laying out IO file (1 file / 3072MiB)
pvc-write: Laying out IO file (1 file / 3072MiB)
[...]

pvc-write: (groupid=0, jobs=64): err= 0: pid=5: Mon Apr 20 20:06:10 2026
  write: IOPS=101, BW=101MiB/s (106MB/s)(8422MiB/83366msec); 0 zone resets
    slat (usec): min=30, max=4294, avg=112.27, stdev=101.58
    clat (msec): min=56, max=81502, avg=40222.51, stdev=23612.02
     lat (msec): min=56, max=81503, avg=40222.62, stdev=23612.00
    clat percentiles (msec):
     |  1.00th=[  126],  5.00th=[ 3104], 10.00th=[ 7416], 20.00th=[15905],
     | 30.00th=[17113], 40.00th=[17113], 50.00th=[17113], 60.00th=[17113],
     | 70.00th=[17113], 80.00th=[17113], 90.00th=[17113], 95.00th=[17113],
     | 99.00th=[17113], 99.50th=[17113], 99.90th=[17113], 99.95th=[17113],
     | 99.99th=[17113]
   bw (  MiB/s): min=  836, max= 3196, per=100.00%, avg=1928.94, stdev=13.26, samples=428
   iops        : min=  836, max= 3196, avg=1928.80, stdev=13.26, samples=428
  lat (msec)   : 100=0.64%, 250=0.84%, 500=0.49%, 750=0.37%, 1000=0.21%
  lat (msec)   : 2000=1.00%, >=2000=96.45%
  cpu          : usr=0.01%, sys=0.00%, ctx=4204, majf=0, minf=523
  IO depths    : 1=0.8%, 2=1.5%, 4=3.0%, 8=6.1%, 16=12.2%, 32=24.3%, >=64=52.1%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=98.6%, 8=0.0%, 16=0.0%, 32=0.0%, 64=1.4%, >=64=0.0%
     issued rwts: total=0,8422,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=101MiB/s (106MB/s), 101MiB/s-101MiB/s (106MB/s-106MB/s), io=8422MiB (8831MB), run=83366-83366msec

Disk stats (read/write):
  vdd: ios=0/8489, sectors=0/17243000, merge=0/1639, ticks=0/258982298, in_queue=258982298, util=99.90%
=== READ TEST ===
pvc-read: (g=0): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=64
...
fio-3.41
Starting 64 processes
pvc-read: Laying out IO file (1 file / 3072MiB)
pvc-read: Laying out IO file (1 file / 3072MiB)
pvc-read: Laying out IO file (1 file / 3072MiB)
[...]

pvc-read: (groupid=0, jobs=64): err= 0: pid=73: Mon Apr 20 20:41:21 2026
  read: IOPS=100, BW=100MiB/s (105MB/s)(9.90GiB/101002msec)
    slat (usec): min=2, max=15897, avg=139.89, stdev=418.01
    clat (msec): min=16, max=78831, avg=38680.75, stdev=19621.03
     lat (msec): min=16, max=78831, avg=38680.89, stdev=19620.90
    clat percentiles (msec):
     |  1.00th=[  567],  5.00th=[ 4597], 10.00th=[ 9731], 20.00th=[17113],
     | 30.00th=[17113], 40.00th=[17113], 50.00th=[17113], 60.00th=[17113],
     | 70.00th=[17113], 80.00th=[17113], 90.00th=[17113], 95.00th=[17113],
     | 99.00th=[17113], 99.50th=[17113], 99.90th=[17113], 99.95th=[17113],
     | 99.99th=[17113]
   bw (  MiB/s): min=  128, max= 3006, per=100.00%, avg=1196.67, stdev=15.29, samples=762
   iops        : min=  128, max= 3006, avg=1196.65, stdev=15.29, samples=762
  lat (msec)   : 20=0.12%, 50=0.38%, 100=0.04%, 250=0.15%, 500=0.25%
  lat (msec)   : 750=0.29%, 1000=0.28%, 2000=1.04%, >=2000=97.47%
  cpu          : usr=0.00%, sys=0.02%, ctx=2923, majf=0, minf=2869
  IO depths    : 1=0.6%, 2=1.3%, 4=2.5%, 8=5.0%, 16=10.1%, 32=20.2%, >=64=60.2%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=1.0%, >=64=0.0%
     issued rwts: total=10142,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=100MiB/s (105MB/s), 100MiB/s-100MiB/s (105MB/s-105MB/s), io=9.90GiB (10.6GB), run=101002-101002msec

Disk stats (read/write):
  vdd: ios=10122/4, sectors=20729856/104, merge=0/9, ticks=329066142/375, in_queue=329066517, util=99.94%